[LANG]
language=Burmese (မြန်မာဘာသာ)
[FONT]
font-name=Myanmar Text
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=အမှား SQL သဒ္ဒါ
200002=ဖိုင်မရှိပါ
200003=ဖိုင်ပျက်စီးနေသည်
200004=ကန့်သတ်ချက်မှားယွင်းနေသည်
200026=ဇယားအမည်ထပ်နေသည်
200027=ဇယားအမည်မရှိပါ
200028=CSV ဖိုင်ထည့်သွင်းမှုမအောင်မြင်၊ SQL မထုတ်နိုင်ပါ၊ CSV ဖိုင်အကြောင်းအရာနှင့် ပြင်ဆင်ချက်မှန်ကန်ကြောင်း စစ်ဆေးပါ
300001=အင်ဒက်စ်ဖန်တီးမည့်ဇယားကွက်အကွက်ကို မရွေးချယ်ထားပါ
300002=SQL ကြော်ငြာစာကွက် မဖြစ်နိုင်ပါ
300003=SQL ခွဲခြမ်းစိတ်ဖြာမှုသည် SELECT စီစစ်မှုကြော်ငြာစာကွက်ကိုသာ ပံ့ပိုးပေးသည်
[STRING]
home=ပင်မစာမျက်နှာ
database=ဒေတာဘေ့စ်
analysis=ခွဲခြမ်းစိတ်ဖြာမှု
view=မြင်ကွင်း
setting=ပြင်ဆင်ချက်
items=မှတ်တမ်း
tables=ဒေတာဇယား
views=မြင်ကွင်းများ
triggers=အစပျိုးစက်များ
columns=ကွက်လပ်များ
indexes=အင်ဒက်စ်များ
table=ဇယား
clear-all=အားလုံးရှင်းလင်း
yes=အတည်ပြု
no=ပယ်ဖျက်
welcome-text=CuteSqlite သို့ကြိုဆိုပါသည်
home-text1=CuteSqlite သည် Sqlite3 အသုံးပြုသူ graphical user client (GUI) ကိရိယာဖြစ်သည်။
home-text2=၎င်းသည် ဒေတာဘေ့စ်ကို ဒီဇိုင်းဆွဲခြင်း၊ ဖန်တီးခြင်းနှင့် ကြည့်ရှုခြင်း၊ ဒေတာဘေ့စ်အရာဝတ္ထုများကို စီမံခန့်ခွဲခြင်းကို ခွင့်ပြုသည်
home-text3=ဒေတာထည့်သွင်းခြင်းနှင့် သိမ်းဆည်းထားသောဒေတာကို စီမံရန် SQL စီစစ်မှုများကို ဒီဇိုင်းဆွဲပြီး run လုပ်ခြင်း
home-text4=အခြားဒေတာဘေ့စ်ထောက်ပံ့သူများထံမှ ဒေတာဘေ့စ်နှင့်ဒေတာကို Sqlite ဒေတာဘေ့စ်သို့ ပြောင်းရွှေ့နိုင်သည်
db-section-text=Sqlite ဒေတာဘေ့စ်
analysis-text1=CuteSqlite သည် SQL ကြော်ငြာစာကွက်၏ စွမ်းဆောင်ရည်ကို ခွဲခြမ်းစိတ်ဖြာပြီး ပြုပြင်နိုင်သည်
analysis-text2=ဒေတာဘေ့စ်ဇယားတစ်ခုစီ၏ သိုလှောင်မှုပမာဏကိုလည်း ခွဲခြမ်းစိတ်ဖြာနိုင်သည်
analysis-text3=ဒေတာဘေ့စ်ပြင်ဆင်ချက်များကို ပြင်ဆင်ကာ ဒေတာဘေ့စ်ကို ပြုပြင်နိုင်သည်
perf-analysis-section-text=စွမ်းဆောင်ရည်ခွဲခြမ်းစိတ်ဖြာမှု
error-text=စနစ်အမှား:
create-database=ဒေတာဘေ့စ်အသစ်ဖန်တီး (Ctrl+N)
open-database=ဒေတာဘေ့စ်ဖွင့် (Ctrl+O)
refresh-database=ဒေတာဘေ့စ်ပြန်လည်ဆန်းစစ် (F5)
delete-database=စာရင်းတွင်ရွေးချယ်ထားသောဒေတာဘေ့စ်ဖယ်ရှား (Del)
override-user-db=ဖိုင်၏ဒေတာကိုဖျက်ပြီးနောက် ပြန်လည်ရယူလို့မရပါ၊ ဒေတာဘေ့စ်ကိုအစားထိုးမလား
create-db-success-text=ဒေတာဘေ့စ်ဖန်တီးခြင်းအောင်မြင်သည်
open-db-exists-inlist=ဒေတာဘေ့စ်ဖွင့်ပြီးသားဖြစ်သဖြင့် ထပ်မံလုပ်ဆောင်ခြင်းမပြုပါနှင့်
open-db-success-text=ဒေတာဘေ့စ်ဖွင့်ခြင်းအောင်မြင်သည်
delete-user-db=စာရင်းမှရွေးချယ်ထားသောဒေတာဘေ့စ် "{dbName}" ကိုဖယ်ရှားမလား
delete-db-success-text=စာရင်းမှဒေတာဘေ့စ်ဖယ်ရှားခြင်းအောင်မြင်သည်
query-editor=စီစစ်မှုတည်းဖြတ်ကိရိယာ
history=သမိုင်းကြောင်း
history-tip=သမိုင်းကြောင်း (F8)
result-list=ရလဒ်
result-info=အချက်အလက်
result-table-data=ဇယားဒေတာ
table-properties=ဇယားဂုဏ်သတ္တိများ
exec-select-sql=ရွေးချယ်ထားသောစီစစ်မှုကို run လုပ် (F9)
exec-all-sql=စီစစ်မှုအားလုံးကို run လုပ် (F10)
explain-select-sql=ရွေးချယ်ထားသော SQL ကြော်ငြာစာကွက်ကို Explain လုပ် (F11)
explain-query-plan-sql=ရွေးချယ်ထားသော SQL ကြော်ငြာစာကွက်ကို Explain query plan လုပ် (F12)
query-page-help=အလိုအလျောက်ပြီးစီးခြင်းအကျင့်: [Tab]->နောက်တစ်ခုလက်ဘလ်; [Ctrl+Space]->ကိုက်ညီသည့်လက်ဘလ်များစာရင်း; [Ctrl+Enter]->လက်ဘလ်အားလုံးစာရင်း
no-select-userdb=ဒေတာဘေ့စ်ကိုမရွေးချယ်ထားပါ
no-sql-statement=စီစစ်မှုတည်းဖြတ်ကိရိယာတွင် SQL ကြော်ငြာစာကွက်ထည့်သွင်းမထားပါ
no-sql-content=စီစစ်မှုတည်းဖြတ်ကိရိယာတွင် SQL ကြော်ငြာစာကွက်မရှိပါ
show-form-view=ဖောင်းမြင်ကွင်းပြသ
export-result-as=... အဖြစ်ထုတ်ယူ (Ctrl+Alt+E)
copy-result-data=ဒေတာကိုကလစ်ဘုတ်သို့ကူးယူ
clear-all=အားလုံးရှင်းလင်း
ok=အတည်ပြု
cancel=ပယ်ဖျက်
export-text-description=ထုတ်ယူမည့်ဒေတာဖော်မတ်ကိုရွေးချယ်ပါ
csv-settings=CSV option များ
csv-field-settings=ကွက်လပ်
csv-line-settings=လိုင်း
csv-charset-settings=ကုဒ်ပုံစံ
excel-settings=Excel option များ
sql-settings=SQL option များ
export-fields-settings=ထုတ်ယူမည့်ကွက်လပ်ကိုရွေးချယ်ပါ
terminated-by=ကွဲကွက်လပ်
enclosed-by=ပါဝင်ကွက်လပ်
escaped-by=ထွက်ပြေးကွက်လပ်
field-terminated-by=ကွက်လပ်ကွဲကွက်လပ်
field-enclosed-by=ကွက်လပ်ပါဝင်ကွက်လပ်
field-escaped-by=ကွက်လပ်ထွက်ပြေးကွက်လပ်
line-terminated-by=လိုင်းအဆုံးသတ်ကွက်လပ်
add-column-name=ခေါင်းစီးတွင်ကွက်လပ်အမည်ထည့်ပါ
csv-charset=ကုဒ်ပုံစံ
excel-column-max-size=စာသားကော်လံအရွယ်အစားကန့်သတ်ချက်
excel-decinmal-places=ဒဿမနေရာ
structure-only=ဇယားဖွဲ့စည်းပုံသာ
data-only=ဒေတာသာ
structure-and-data=ဇယားဖွဲ့စည်းပုံနှင့်ဒေတာ
select-all=အားလုံးရွေးချယ်
deselect-all=အားလုံးမရွေးချယ်
save-to-file=ဖိုင်သို့ထုတ်ယူ
expert-fmt-error=ဒေတာထုတ်ယူမည့်ဖိုင်ဖော်မတ်ကိုရွေးချယ်ပါ
terminated-by-error=“အဆုံးသတ်သည်” တန်ဖိုးကိုထည့်သွင်းပါ
enclosed-by-error=“အတွင်းပါဝင်သည်” တန်ဖိုးကိုထည့်သွင်းပါ
escaped-by-error=“ထွက်ပြေးကွက်လပ်” တန်ဖိုးကိုထည့်သွင်းပါ
line-terminated-by-error=လိုင်း၏“အဆုံးသတ်သည်” တန်ဖိုးမမှန်ကန်ပါ
excel-column-max-size-error=“စာသားကော်လံအရွယ်အစားကန့်သတ်ချက်” တန်ဖိုးကိုထည့်သွင်းပါ
excel-decinmal-places-error=“ဒဿမနေရာ” တန်ဖိုးကိုထည့်သွင်းပါ
export-sql-error=SQL option ကိုရွေးချယ်ပါ
selected-fields-error=ထုတ်ယူမည့်ကွက်လပ်ကိုရွေးချယ်ပါ
export-path-error=ထုတ်ယူမည့်ဖိုင်လမ်းကြောင်းကိုထည့်သွင်းပါ
sql-notsupport-multitable-query-error=ဇယားအများစုစီစစ်မှုနှင့်အမျိုးအစားစီစစ်မှုရလဒ်ထုတ်ယူခြင်းကိုမပံ့ပိုးပါ
export-success-text=ထုတ်ယူခြင်းအောင်မြင်သည်၊ {rows} မြောက်မှတ်တမ်းထုတ်ယူပြီးသားဖြစ်သည်၊ ဖိုင်ဖွင့်မလား
open-the-file=ဖိုင်ဖွင့်ပါ
export-file-exists-prompt={export-path} ရှိပြီးသားဖြစ်သည်၊ အစားထိုးမလား
limit-rows=ကန့်သတ်မြောက်
offset=စမြောက်
rows=မြောက်အရေအတွက်
copy-all-rows-to-clipboard=မြောက်အားလုံးကိုကလစ်ဘုတ်သို့ကူးယူ	Ctrl+Alt+A
copy-sel-rows-to-clipboard=ရွေးချယ်ထားသောမြောက်များကိုကလစ်ဘုတ်သို့ကူးယူ	Ctrl+Alt+H
copy-all-rows-as-sql=မြောက်အားလုံးကို SQL အဖြစ်ကူးယူ	Ctrl+Alt+J
copy-sel-rows-as-sql=ရွေးချယ်ထားသောမြောက်များကို SQL အဖြစ်ကူးယူ	Ctrl+Alt+K
read-only=ဖတ်ရန်သာ
filter=စစ်ထုတ်ကိရိယာ (Ctrl+Alt+F)
filter-in-use=စစ်ထုတ်ကိရိယာအသုံးပြုနေသည်
refresh=ပြန်လည်ဆန်းစစ် (Ctrl+F5)
refresh-page=စာမျက်နှာပြန်လည်ဆန်းစစ်
new-row-tip=မြောက်အသစ်ဖန်တီး (Ctrl+Alt+N)
copy-row-tip=မြောက်တစ်ခုကူးယူ (Ctrl+Alt+C)
save-tip=သိမ်းဆည်း (Ctrl+Alt+S)
delete-tip=ရွေးချယ်ထားသောမြောက်ကိုဖျက်ပါ (Ctrl+Del)
cancel-tip=ပြောင်းလဲမှုများကိုပယ်ဖျက် (Ctrl+Alt+Z)
revert-tip=ပြန်လည်ရယူ
save=သိမ်းဆည်း
revert=ပြောင်းလဲမှုများကိုပယ်ဖျက်
column=ကွက်လပ်အမည်
condition=အခြေအနေ
value=တန်ဖိုး
delete-confirm-text=ရွေးချယ်ထားသောမြောက်များကိုဖျက်မလား
query=စီစစ်မှု
result=ရလဒ်
affected-rows=အကျိုးသက်ရောက်မြောက်များ
exec-time=run လုပ်ချိန်ကြာမှု
transfer-time=လွှင့်ပို့ချိန်ကြာမှု
total-time=စုစုပေါင်းချိန်ကြာမှု
database-create=ဒေတာဘေ့စ်အသစ်		Ctrl+N
database-open=ဒေတာဘေ့စ်ဖွင့်		Ctrl+O
database-refresh=ဒေတာဘေ့စ်ပြန်လည်ဆန်းစစ်		Ctrl+R
database-delete=ဒေတာဘေ့စ်ဖျက်		Del
database-copy=ဒေတာဘေ့စ်ကို... အဖြစ်ကူးယူ	Ctrl+P
database-export-as-sql=ဒေတာဘေ့စ်ကို SQL သို့ထုတ်ယူ	Ctrl+E
database-import-from-sql=SQL မှဒေတာဘေ့စ်သို့ထည့်သွင်း	Ctrl+I
database-new=ဖန်တီး
database-new-table=ဇယား
database-new-view=မြင်ကွင်း
database-new-trigger=အစပျိုးစက်
export-as-sql-text-description=ရွေးချယ်ထားသောဒေတာဘေ့စ်၏ဇယား/မြင်ကွင်း/အစပျိုးစက်ကို SQL ပုံစံဖြင့်ထုတ်ယူပါ
select-database=ရွေးချယ်ထားသောဒေတာဘေ့စ်
database-objects=အရာဝတ္ထုများ
structure-and-data-settings=ဖွဲ့စည်းပုံနှင့်ဒေတာပြင်ဆင်ချက်
insert-statement-settings=INSERT ကြော်ငြာစာကွက်ပြင်ဆင်ချက်
tbl-statement-settings=ဒေတာဇယားကြော်ငြာစာကွက်ပြင်ဆင်ချက်
retain-column-text=“Insert Into” တွင်ကော်လံအမည်ကိုထိန်းသိမ်းပါ
contain-multi-rows-text=“Insert” ကြော်ငြာစာကွက်တစ်ခုစီတွင် မြောက်များစုပါဝင်သည် (VALUES)
retain-table-text=ဇယားဟောင်းကိုထိန်းသိမ်းပါ (Create Table If Not Exists ...)
override-table-text=ဇယားဟောင်းကိုအစားထိုးပါ (DROP TABLE, ထို့နောက် CREATE TABLE)
import-from-sql-text-description=SQL ဖိုင်အတွင်းရှိကြော်ငြာစာကွက်များကိုအုပ်စုဖြင့် run လုပ်ပါ
abort-on-error-text=အမှားဖြစ်လျှင်ရပ်ဆိုင်းပါ
import-file-not-exists=ထည့်သွင်းမည့် SQL ဖိုင်မရှိပါ၊ ထပ်မံရွေးချယ်ပါ
import-path-empty-error=ထည့်သွင်းမည့်ဖိုင်လမ်းကြောင်းမဖြစ်နိုင်ပါ
import=ထည့်သွင်း
export=ထုတ်ယူ
tbl-name=ဇယားအမည်
new-table=ဇယားဖန်တီး
new-view=မြင်ကွင်းဖန်တီး
new-trigger=အစပျိုးစက်ဖန်တီး
database=ဒေတာဘေ့စ်
schema=Schema
table-columns=ကွက်လပ်များ
table-indexes=အင်ဒက်စ်များ
table-foreignkeys=ပြင်ပသော့များ
column-name=ကွက်လပ်အမည်
data-type=ဒေတာအမျိုးအစား
default=ပုံမှန်
check=စစ်ဆေး
index-name=အင်ဒက်စ်အမည်
index-type=အင်ဒက်စ်အမျိုးအစား
index-unique=ထူးခြားသည်
partial-clause=တစ်စိတ်တစ်ပိုင်းပုဒ်စု
comments=မှတ်ချက်များ
to-be-selected=ရွေးချယ်မည့်ကွက်လပ်များ
selected=ရွေးချယ်ပြီးသားကွက်လပ်များ
up=▲
down=▼
no-columns-selected=ကွက်လပ်မရွေးချယ်ထားပါ၊ ကျေးဇူးပြု၍ရွေးချယ်ပါ
sql-preview=SQL အစမြင်ကွင်း
tbl-name-empty=ဇယားအမည်မဖြစ်နိုင်ပါ
tbl-name-duplicated=ဇယားအမည်ထပ်နေသည်
create-table-success-text=ဇယားဖန်တီးခြင်းအောင်မြင်သည်
alter-table-success-text=ဇယားပြင်ဆင်ခြင်းအောင်မြင်သည်
rename-table-success-text=ဇယားအမည်ပြောင်းခြင်းအောင်မြင်သည်
delete-column-confirm-text=ရွေးချယ်ထားသောကွက်လပ်ကို အင်ဒက်စ်တစ်ခု သို့မဟုတ် တစ်ခုထက်ပိုများကိုးကားထားသည်၊ ဤကော်လံကိုဖျက်ခြင်းသည် သက်ဆိုင်ရာအင်ဒက်စ်ကိုလည်းပြင်ဆင်လိမ့်မည်၊ ဆက်လက်ဖျက်မလား
delete-index-confirm-text=ရွေးချယ်ထားသောအင်ဒက်စ်ကို ကွက်လပ်တစ်ခု သို့မဟုတ် တစ်ခုထက်ပိုများကိုးကားထားသည်၊ ဤအင်ဒက်စ်ကိုဖျက်ခြင်းသည် သက်ဆိုင်ရာကွက်လပ်ကိုလည်းပြင်ဆင်လိမ့်မည်၊ ဆက်လက်ဖျက်မလား
delete-confirm-text=ဆက်လက်ဖျက်မလား
new-view=မြင်ကွင်းဖန်တီး
new-trigger=အစပျိုးစက်ဖန်တီး
create-a-view-name=မြင်ကွင်းအမည်အသစ်
view-name-not-empty=မြင်ကွင်းအမည်အသစ်မဖြစ်နိုင်ပါ
view-name-duplicated=မြင်ကွင်းအမည်ထပ်နေသည်
create-a-trigger-name=အစပျိုးစက်အမည်
trigger-name-not-empty=အစပျိုးစက်အမည်မဖြစ်နိုင်ပါ
trigger-name-duplicated=အစပျိုးစက်အမည်ထပ်နေသည်
execute-sql-success=SQL run လုပ်ခြင်းအောင်မြင်သည်
copy-db-success-text=ဒေတာဘေ့စ်ကူးယူခြင်းအောင်မြင်သည်
table-open=ဇယားဒေတာဖွင့်		Alt+O
table-create=ဇယားဖန်တီး		Alt+N
table-alter=ဇယားပြင်ဆင်		Alt+A
table-rename=ဇယားအမည်ပြောင်း		Alt+M
table-truncate=ဇယားရှင်းလင်း		Alt+T
table-drop=ဇယားဖျက်		Alt+Del
table-copy-as=ဇယားကို... သို့ကူးယူ		Alt+P
table-sharding-as=အပိုင်းခွဲ		Alt+G
table-export=ဇယားကို... သို့ထုတ်ယူ	Alt+E
table-import-sql=SQL ဖိုင်မှထည့်သွင်း	Alt+I
table-import-csv=CSV ဖိုင်မှထည့်သွင်း	Alt+J
table-manage-index=ဇယားအင်ဒက်စ်စီမံခန့်ခွဲ
table-manage-foreign-key=ဇယားပြင်ပသော့စီမံခန့်ခွဲ
properties=ဂုဏ်သတ္တိများ
primary-key-duplicated=အဓိကသော့ (Primary key) ထပ်မံသတ်မှတ်နေသည်
foreignkey-name=ပြင်ပသော့အမည်
referencing-columns=ဤဇယားကွက်လပ်များ
referenced-table=ပြင်ပဇယား
referenced-columns=ပြင်ပကွက်လပ်များ
on-update=On Update
on-delete=On Delete
insert-new-column=ကွက်လပ်အသစ်ထည့်ပါ
insert-new-index=အင်ဒက်စ်အသစ်ထည့်ပါ
insert-new-foreignkey=ပြင်ပသော့အသစ်ထည့်ပါ
insert-del-column=ရွေးချယ်ထားသောကွက်လပ်ကိုဖျက်ပါ
insert-del-index=ရွေးချယ်ထားသောအင်ဒက်စ်ကိုဖျက်ပါ
insert-del-foreignkey=ရွေးချယ်ထားသောပြင်ပသော့ကိုဖျက်ပါ
select-referenced-table-first=ပြင်ပဇယားကိုအရင်ရွေးချယ်ပါ
new-table-name=ဇယားအမည်အသစ်
table-name-not-empty=ဇယားအမည်အသစ်မဖြစ်နိုင်ပါ
table-name-duplicated=ဇယားအမည်အသစ်ထပ်နေသည်
ai-column-exists=အလိုအလျောက်တိုးမြင့်ကွက်လပ် (AUTOINCREMENT) ရှိပြီးသားဖြစ်သည်
ai-fobidden-multi-pk=အလိုအလျောက်တိုးမြင့်ကွက်လပ်ရှိနေသဖြင့် အဓိကသော့ကွက်လပ်များစွာကိုခွင့်မပြုပါ
ai-column-must-integer=အလိုအလျောက်တိုးမြင့်ကွက်လပ် (AUTOINCREMENT) သည် INTEGER ကိန်းပြည့်အမျိုးအစားဖြစ်ရမည်
truncate-table-confirm-text=ဇယားရှင်းလင်းပြီးနောက် ဒေတာကိုပြန်လည်ရယူလို့မရပါ၊ ရှင်းလင်းမလား
truncate-table-success-text=ဒေတာဇယားရှင်းလင်းခြင်းအောင်မြင်သည်
drop-table-confirm-text=ဒေတာဇယားဖျက်ပြီးနောက် ဒေတာကိုပြန်လည်ရယူလို့မရပါ၊ ဖျက်မလား
drop-table-success-text=ဒေတာဇယားဖျက်ခြင်းအောင်မြင်သည်
copy-table-text-description=ကူးယူကန့်သတ်ချက်များကိုပြင်ဆင်ပါ၊ ဒေတာဇယားအပိုင်းခွဲခြင်းကိုပံ့ပိုးပါ
from-db-name=ရင်းမြစ်ဒေတာဘေ့စ်
from-tbl-name=ရင်းမြစ်ဇယား
to-db-name=ပစ်မှတ်ဒေတာဘေ့စ်
to-tbl-name=ပစ်မှတ်ဇယား
table-sharding-setttings=ဒေတာဇယားအပိုင်းခွဲခြင်း
enable-table-sharding=ဒေတာဇယားအပိုင်းခွဲခြင်းကိုဖွင့်ပါ
table-suffix-begin={suffix} စတင်ကိန်းပြည့်
table-suffix-end={suffix} အဆုံးကိန်းပြည့်
advanced-settings=ဇယားအပိုင်းခွဲအဆင့်မြင့် option များ
enable-copy-data-with-strategy=ဗျူဟာကိုဖွင့်ပါ၊ ဒေတာကိုအပိုင်းခွဲဇယားသို့ကူးယူပါ
sharding-strategy-express-text=ဇယားအပိုင်းခွဲဗျူဟာဖော်ပြချက်: {n}
preview-sql=SQL ကြော်ငြာစာကွက်အစမြင်ကွင်း
structure-and-data-settings-unknown=ဖွဲ့စည်းပုံနှင့်ဒေတာပြင်ဆင်ချက်ကိုမရွေးချယ်ထားပါ
table-suffix-error=အပိုင်းခွဲကိန်းပြည့်မမှန်ကန်ပါ၊ မှန်ကန်သောတန်ဖိုးကိုဖြည့်ပါ
target-table-name-no-n=ပစ်မှတ်ဇယားတွင် "{n}" စာကြောင်းပါဝင်ရမည်
sharding-strategy-express-empty=ဇယားအပိုင်းခွဲဗျူဟာဖော်ပြချက်မဖြစ်နိုင်ပါ
copy-table-success-text=ဇယားကူးယူခြင်းအောင်မြင်သည်
start=စတင်
complete=ပြီးစီး
express-title=ဇယားအပိုင်းခွဲဗျူဟာဖော်ပြချက်
functions=လုပ်ဆောင်ချက်များ
express-editor-help=ဖော်ပြချက် - လုပ်ဆောင်ချက် သို့မဟုတ် ကွက်လပ်ကိုနှစ်ချက်နှိပ်ပြီး တည်းဖြတ်ကိရိယာသို့ထည့်သွင်းပါ
import-from-csv-text-description=CSV ဖိုင်မှဒေတာထည့်သွင်းမှုပြင်ဆင်ချက်များ
source-csv-file=ရင်းမြစ် CSV ဖိုင်လမ်းကြောင်း
target-database=ပစ်မှတ်ဒေတာဘေ့စ်
target-table=ပစ်မှတ်ဇယား
columns-setttings=ကွက်လပ်များ
csv-data=CSV ဒေတာ
column-name-on-top=ပထမလိုင်းကိုကွက်လပ်အမည်အဖြစ်သတ်မှတ်ပါ
line-terminated-by=လိုင်းအဆုံးသတ်ကွက်လပ်
csv-null-as-keyword=null/NULL ကို SQL keyword အဖြစ်သတ်မှတ်ပါ
encoding=ကုဒ်ပုံစံ
import-success-text=ထည့်သွင်းခြင်းအောင်မြင်သည်
incorrect-sql-statement=မှားယွင်းသော SQL ကြော်ငြာစာကွက်
import-error-text=ထည့်သွင်းမှုအမှား
table-manage-columns=ကွက်လပ်များစီမံခန့်ခွဲ
table-drop-column=ကွက်လပ်ဖျက်
table-manage-indexes=အင်ဒက်စ်များစီမံခန့်ခွဲ
table-drop-index=အင်ဒက်စ်ဖျက်
create-view=မြင်ကွင်းအသစ်ဖန်တီး
open-view=မြင်ကွင်းဖွင့်
drop-view=မြင်ကွင်းဖျက်
create-trigger=အစပျိုးစက်ဖန်တီး
open-trigger=အစပျိုးစက်ဖွင့်
drop-trigger=အစပျိုးစက်ဖျက်
drop-view-confirm-text=မြင်ကွင်းဖျက်ပြီးနောက် ပြန်လည်ရယူလို့မရပါ၊ ဖျက်မလား
drop-view-success-text=မြင်ကွင်းဖျက်ခြင်းအောင်မြင်သည်
drop-trigger-confirm-text=အစပျိုးစက်ဖျက်ပြီးနောက် ပြန်လည်ရယူလို့မရပါ၊ ဖျက်မလား
drop-trigger-success-text=အစပျိုးစက်ဖျက်ခြင်းအောင်မြင်သည်
sql-templates=SQL ကြော်ငြာစာကွက်မူဘောင်များ
pragma-templates=Pragmas
sql-log=SQL သမိုင်းကြောင်း
clear-all=အားလုံးရှင်းလင်း
use=အသုံးပြု
explain=Explain
top=ထိပ်တင်
untop=ထိပ်တင်ခြင်းဖြုတ်
copy=ကူးယူ
delete=ဖျက်
today=ယနေ့
yestoday=မနေ့က
delete-sql-log-confirm-text=SQL မှတ်တမ်းကိုဖျက်မလား
copy-to-clipboard=ကလစ်ဘုတ်သို့ကူးယူပြီးသားဖြစ်သည်
save-success-text=သိမ်းဆည်းခြင်းအောင်မြင်သည်
delete-success-text=ဖျက်ခြင်းအောင်မြင်သည်
data-has-changed=ဒေတာပြောင်းလဲသွားပြီဖြစ်သည်၊ စာမျက်နှာကိုပိတ်မလား
not-save-and-close=မသိမ်းပါ၊ ပိတ်ပါ
cancel=ပိတ်ခြင်းကိုပယ်ဖျက်
table-export-as=ဒေတာဇယားထုတ်ယူ	Alt+E
export-as-sql-success-text=ထုတ်ယူခြင်းအောင်မြင်သည်၊ ဖိုင်ဖွင့်မလား
new-query=စီစစ်မှုပြတင်းပေါက်အသစ် (F7)
save-current=လက်ရှိကိုသိမ်းဆည်း (Ctrl+S)
save-all=အားလုံးသိမ်းဆည်း (Ctrl+Shift+S)
first-page=ပထမစာမျက်နှာ
prev-page=ရှေ့စာမျက်နှာ
next-page=နောက်စာမျက်နှာ
last-page=နောက်ဆုံးစာမျက်နှာ
save-if-data-has-changed=ဒေတာပြောင်းလဲသွားပြီဖြစ်သည်၊ အရင်သိမ်းမလား
unsort=အစီအစဥ်ဖြုတ်
tab-close-this=ပိတ်
tab-close-others=လက်ရှိမဟုတ်သောပိတ်
tab-close-left=ဘယ်ဘက်အားလုံးပိတ်
tab-close-right=ညာဘက်အားလုံးပိတ်
perf-analysis=စွမ်းဆောင်ရည်ခွဲခြမ်းစိတ်ဖြာမှု
perf-analysis-reports=ခွဲခြမ်းစိတ်ဖြာအစီရင်ခံစာများ
store-analysis=သိုလှောင်မှုခွဲခြမ်းစိတ်ဖြာမှု
db-params=ဒေတာဘေ့စ်ကန့်သတ်ချက်များ
not-select-sql=SELECT ကြော်ငြာစာကွက်ကိုသာပံ့ပိုးပါ
open-sql-log=စွမ်းဆောင်ရည်ခွဲခြမ်းစိတ်ဖြာမှုအတွက် SQL မှတ်တမ်းဖွင့် (Ctrl+L)
add-sql-analysis=စွမ်းဆောင်ရည်ခွဲခြမ်းစိတ်ဖြာမှုအတွက် SQL ကြော်ငြာစာကွက်ထည့်သွင်း (Ctrl+I)
sql-log-not-found=SQL မှတ်တမ်းမတွေ့ပါ၊ ဖျက်ပြီးသားမဟုတ်ကြောင်းစစ်ဆေးပါ
original-sql=မူလ SQL ကြော်ငြာစာကွက်
where-clause-analysis=WHERE ပုဒ်စုခွဲခြမ်းစိတ်ဖြာမှု
order-clause-analysis=ORDER ပုဒ်စုခွဲခြမ်းစိတ်ဖြာမှု
covering-index-analysis=ဖုံးအုပ်အင်ဒက်စ်ခွဲခြမ်းစိတ်ဖြာမှု
table-join-analysis=Joins ခွဲခြမ်းစိတ်ဖြာမှု
in-table=ဒေတာဇယား
where-use-column=WHERE ကြော်ငြာစာတွင်ကွက်လပ်ကိုအသုံးပြုသည်
order-use-column=ORDER ကြော်ငြာစာတွင်ကွက်လပ်ကိုအသုံးပြုသည်
covering-index-column=WHERE နှင့် ORDER ကြော်ငြာစာတွင်ကွက်လပ်ကိုအသုံးပြုသည်
where-use-index=WHERE ကြော်ငြာစာတွင်အင်ဒက်စ်ကိုအသုံးပြုသည်
order-use-index=ORDER ကြော်ငြာစာတွင်အင်ဒက်စ်ကိုအသုံးပြုသည်
use-covering-index=ဖုံးအုပ်အင်ဒက်စ်ကိုအသုံးပြုသည်
create-index-for-performance=အကြံပြုချက်: အောက်ပါကွက်လပ်များအတွက်အင်ဒက်စ်ဖန်တီးခြင်းသည် စီစစ်မှုစွမ်းဆောင်ရည်ကိုမြှင့်တင်ပေးမည်
hint-index-for-performance=အကြံပြုချက်: အင်ဒက်စ် {hintIndexName} သည် ပါဝင်သောကွက်လပ်များကိုဖုံးအုပ်ပြီးသားဖြစ်သည်: {hintIndexColumns}
create-covering-index-for-performance=အကြံပြုချက်: အောက်ပါကွက်လပ်များအတွက်ဖုံးအုပ်အင်ဒက်စ်ဖန်တီးခြင်းသည် စီစစ်မှုစွမ်းဆောင်ရည်ကိုမြှင့်တင်ပေးမည်
create-index-togeger=အင်ဒက်စ်ဖန်တီး
create-index-individ=အင်ဒက်စ်ကိုသီးခြားဖန်တီးပါ
create-covering-index=ဖုံးအုပ်အင်ဒက်စ်ဖန်တီးပါ
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=အောက်ပါ pseudocode သည် စီစစ်မှု optimize လုပ်သူ၏လုပ်ဆောင်မှုဖြစ်စဉ်ကိုပြသသည်
cycle-count=စက်ဝိုင်းစာရင်း
optimize-cycle-count=အကြံပြုချက်: JOIN ဇယားအမျိုးမျိုးသောအစီအစဥ်ကိုပြောင်းလဲခြင်းဖြင့် စက်ဝိုင်းအရေအတွက်ကိုလျှော့ချနိုင်သည်
general-settings=ယေဘုယျပြင်ဆင်ချက်
about=ကျွန်ုပ်တို့အကြောင်း
language-setting=အင်တာဖေ့စ်ဘာသာစကားပြင်ဆင်ချက်
change-language-restart-text=ဘာသာစကားပြောင်းလဲခြင်းအတွက် ဆော့ဖ်ဝဲလ်ကိုပြန်လည်စတင်ရမည်ဖြစ်သည်
close-and-restart=ပိတ်ပြီးပြန်လည်စတင်
do-not-restart=မပြန်လည်စတင်
about-us=ကျွန်ုပ်တို့အကြောင်း
about-us-description=CuteSqlite သည် Xuehan Qin ကရေးသားထားသော open source ဆော့ဖ်ဝဲလ်ဖြစ်သည်
version-info=ဗားရှင်းအချက်အလက်
version-info-description=CuteSqlite v0.2.2 beta (64 bit)
feedback=တုံ့ပြန်ချက်
feedback-description=ဆော့ဖ်ဝဲလ်ပြသနာများ သို့မဟုတ် အကြံဥာဏ်များရှိပါက အောက်ပါဖောင်းပြည့်စေပြီး တုံ့ပြန်ပေးပါ
content-text=အကြောင်းအရာ
license=Apache License Version 2.0
select-columns-analysis=Select ကွက်လပ်ခွဲခြမ်းစိတ်ဖြာမှု
select-use-column=Select ကြော်ငြာစာတွင်အောက်ပါကွက်လပ်များကိုအသုံးပြုသည်
select-use-column-count=ကွက်လပ်အရေအတွက်
select-use-column-advice=အကြံပြုချက်: SELECT ကြော်ငြာစာတွင်ရွေးချယ်ထားသောကွက်လပ်များသည် {maxColumns} ကိုကျော်လွန်နေသည်၊ ကွက်လပ်များကိုလျှော့ချခြင်းဖြင့် စီစစ်မှုစွမ်းဆောင်ရည်ကိုမြှင့်တင်ပါ
select-use-column-tips=အကြံပြုချက်: ကွက်လပ်များကိုလျှော့ချခြင်းဖြင့် စီစစ်မှုစွမ်းဆောင်ရည်ကိုမြှင့်တင်ပါ
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=သိုလှောင်မှုခွဲခြမ်းစိတ်ဖြာမှု:
analysis-sql=SQL ခွဲခြမ်းစိတ်ဖြာမှု
open-perf-report=အစီရင်ခံစာဖွင့်		Alt+O
drop-perf-report=အစီရင်ခံစာဖျက်		Alt+Del
drop-perf-report-confirm-text=အစီရင်ခံစာကိုဖျက်မလား
store-analysis-text=ဒေတာဘေ့စ်၊ ဒေတာဇယား၊ ဇယားအင်ဒက်စ်၏ သိုလှောင်မှုပမာဏကိုခွဲခြမ်းစိတ်ဖြာခွင့်ပေးသည်
table-store-analysis=ဇယား - {tblName}
index-store-analysis=အင်ဒက်စ် - {idxName} - ပိုင်ရှင်ဇယား: {tblName}
db-disk-used-title=ဒစ်ပိုင်းအသုံးပြုမှုနှုန်းအစီရင်ခံစာ၊ DB လမ်းကြောင်း: {dbPath}
page-size-text=စာမျက်နှာအရွယ်အစား (ယူနစ်: byte)
page-size-tips=စာမျက်နှာအရွယ်အစား (ယူနစ်: byte)
file-bytes-text=ဖိုင်အရွယ်အစား (ယူနစ်: byte)
file-bytes-tips=ဖိုင်အရွယ်အစား (ယူနစ်: byte)
file-pgcnt-text=ဖိုင်တစ်ခုလုံးအတွင်းရှိစာမျက်နှာအရေအတွက် (တိုင်းတာချက်)
file-pgcnt-tips=ဖိုင်တစ်ခုလုံးအတွင်းရှိစာမျက်နှာအရေအတွက် (တိုင်းတာချက်)
file-pgcnt2-text=ဖိုင်တစ်ခုလုံးအတွင်းရှိစာမျက်နှာအရေအတွက် (တွက်ချက်မှု)
file-pgcnt2-tips=ဖိုင်တစ်ခုလုံးအတွင်းရှိစာမျက်နှာအရေအတွက် (တွက်ချက်မှု)
inuse-pgcnt-text=ဒေတာသိုလှောင်ထားသောစာမျက်နှာများ (အသုံးပြုပြီးသား)
inuse-pgcnt-tips=ဒေတာသိုလှောင်ထားသောစာမျက်နှာများ (အသုံးပြုပြီးသား)
free-pgcnt2-text=ဒေတာမသိုလှောင်ထားသောစာမျက်နှာများ (ခေါင်းစီးတစ်ခုစီ)
free-pgcnt2-tips=ဒေတာမသိုလှောင်ထားသောစာမျက်နှာများ (ခေါင်းစီးတစ်ခုစီ)
free-pgcnt-text=ဒေတာမသိုလှောင်ထားသောစာမျက်နှာများ (တွက်ချက်မှု)
free-pgcnt-tips=ဒေတာမသိုလှောင်ထားသောစာမျက်နှာများ (တွက်ချက်မှု)
av-pgcnt-text=အလိုအလျောက်ရှင်းလင်းထားသောစာမျက်နှာများ
av-pgcnt-tips=အလိုအလျောက်ရှင်းလင်းထားသောစာမျက်နှာများ
ntable-text=ဒေတာဘေ့စ်အတွင်းရှိဇယားအရေအတွက်
ntable-tips=ဒေတာဘေ့စ်အတွင်းရှိဇယားအရေအတွက်
nindex-text=အင်ဒက်စ်အရေအတွက်
nindex-tips=အင်ဒက်စ်အရေအတွက်
nmanindex-text=သတ်မှတ်ထားသောအင်ဒက်စ်အရေအတွက်
nmanindex-tips=သတ်မှတ်ထားသောအင်ဒက်စ်အရေအတွက်
nautoindex-text=သက်ရှိအင်ဒက်စ်အရေအတွက် (အလိုအလျောက်တိုးမြင့်အင်ဒက်စ်)
nautoindex-tips=သက်ရှိအင်ဒက်စ်အရေအတွက် (အလိုအလျောက်တိုးမြင့်အင်ဒက်စ်)
user-payload-text=အသုံးပြုသူထိရောက်သော payload သိုလှောင်ထားသော byte အရေအတွက်
user-payload-tips=အသုံးပြုသူထိရောက်သော payload သိုလှောင်ထားသော byte အရေအတွက်
all-tbl-entrycnt-title=ဇယားဒေတာပမာဏအားလုံး (အရေအတွက်)
all-tbl-idx-pagecnt-title=ဇယားနှင့်၎င်း၏အင်ဒက်စ်များစာမျက်နှာအရေအတွက်အားလုံး
sperate-tbl-idx-pagecnt-title=ဇယားနှင့်အင်ဒက်စ်စာမျက်နှာအရေအတွက်အားလုံးကိုသီးခြားတွက်ချက်သည်
all-tbl-idx-report-title=ဇယားနှင့်အင်ဒက်စ်အားလုံး
total-pages-percent-text=ဒေတာဘေ့စ်စုစုပေါင်း၏ရာခိုင်နှုန်း
total-pages-percent-tips=ဒေတာဘေ့စ်စုစုပေါင်း၏ရာခိုင်နှုန်း
nentry-text=ဒေတာပမာဏ (အရေအတွက်)
nentry-tips=ဒေတာပမာဏ (အရေအတွက်)
storage-text=သုံးစွဲသောသိုလှောင်မှု byte အရေအတွက်
storage-tips=သုံးစွဲသောသိုလှောင်မှု byte အရေအတွက်
compressed-size-text=ဖိသိပ်ပြီးနောက်အသုံးပြုသော byte အရေအတွက်
compressed-size-tips=ဖိသိပ်ပြီးနောက်အသုံးပြုသော byte အရေအတွက်
payload-text=ထိရောက်သော payload byte အရေအတွက်
payload-tips=ထိရောက်သော payload byte အရေအတွက်
total-meta-text=meta data byte အရေအတွက်
total-meta-tips=meta data byte အရေအတွက်
depth-text=B tree အနက်ပိုင်း
depth-tips=B tree အနက်ပိုင်း
avg-payload-text=ဒေတာတစ်ခုစီ၏ပျမ်းမျှထိရောက်သော payload
avg-payload-tips=ဒေတာတစ်ခုစီ၏ပျမ်းမျှထိရောက်သော payload
avg-unused-text=ဒေတာတစ်ခုစီ၏ပျမ်းမျှမအသုံးပြုသော byte အရေအတွက်
avg-unused-tips=ဒေတာတစ်ခုစီ၏ပျမ်းမျှမအသုံးပြုသော byte အရေအတွက်
avg-meta-text=ဒေတာတစ်ခုစီ၏ပျမ်းမျှ meta data
avg-meta-tips=ဒေတာတစ်ခုစီ၏ပျမ်းမျှ meta data
avg-fanout-text=ပျမ်းမျှ fanout အရေအတွက်
avg-fanout-tips=ပျမ်းမျှ fanout အရေအတွက်
gap-cnt-text=ဆက်တိုက်မဟုတ်သောစာမျက်နှာများ
gap-cnt-tips=ဆက်တိုက်မဟုတ်သောစာမျက်နှာများ
mx-payload-text=ဒေတာတစ်ခုစီ၏အကြီးဆုံးထိရောက်သော payload
mx-payload-tips=ဒေတာတစ်ခုစီ၏အကြီးဆုံးထိရောက်သော payload
ovfl-cnt-text=အသုံးပြုပြီးသောပိုက်ဆံအပိုဒေတာအရေအတွက်
ovfl-cnt-tips=အသုံးပြုပြီးသောပိုက်ဆံအပိုဒေတာအရေအတွက်
int-pages-text=အသုံးပြုပြီးသောအင်ဒက်စ်စာမျက်နှာများ
int-pages-tips=အသုံးပြုပြီးသောအင်ဒက်စ်စာမျက်နှာများ
leaf-pages-text=အသုံးပြုပြီးသောပင်မစာမျက်နှာများ
leaf-pages-tips=အသုံးပြုပြီးသောပင်မစာမျက်နှာများ
ovfl-pages-text=အသုံးပြုပြီးသောပိုက်ဆံအပိုစာမျက်နှာများ
ovfl-pages-tips=အသုံးပြုပြီးသောပိုက်ဆံအပိုစာမျက်နှာများ
total-pages-text=အသုံးပြုပြီးသောစာမျက်နှာစုစုပေါင်း
total-pages-tips=အသုံးပြုပြီးသောစာမျက်နှာစုစုပေါင်း
int-unused-text=အင်ဒက်စ်စာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
int-unused-tips=အင်ဒက်စ်စာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
leaf-unused-text=ပင်မစာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
leaf-unused-tips=ပင်မစာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
ovfl-unused-text=ပိုက်ဆံအပိုစာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
ovfl-unused-tips=ပိုက်ဆံအပိုစာမျက်နှာပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
total-unused-text=စာမျက်နှာအားလုံးပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
total-unused-tips=စာမျက်နှာအားလုံးပေါ်ရှိမအသုံးပြုသော byte အရေအတွက်
all-table-report-title=ဇယားအားလုံး (အင်ဒက်စ်ဖယ်ထား)
all-indices-report-title=အင်ဒက်စ်အားလုံး (ဇယားဖယ်ထား)
tbl-and-all-idx-report-title=ဇယား {tblName} နှင့်၎င်း၏အင်ဒက်စ်အားလုံး
tbl-only-report-title=ဇယား {tblName} မည်သည့်အင်ဒက်စ်မှမပါဝင်ပါ
idx-only-report-title=ဇယား {tblName} ၏အင်ဒက်စ်အားလုံး
tbl-report-title=ဇယား {tblName}
idx-report-title=ဇယား {tblName} ၏အင်ဒက်စ် {idxName}
props-tbl-only-report-title=ဇယား {tblName} သိုလှောင်မှုခွဲခြမ်းစိတ်ဖြာမှု
props-idx-props-only-report-title=ဇယား {tblName} ၏အင်ဒက်စ်အားလုံး
db-pragma-params=PRAGMA ကန့်သတ်ချက်များ
db-quick-config-params=အမြန်ပြင်ဆင်မှုအစီအစဉ်
select-pragma=PRAGMA
pragma-analysis-limit-tips=ခန့်မှန်းခြေခွဲခြမ်းစိတ်ဖြာ (ANALYZE) ပြင်ဆင်ချက်၏ကန့်သတ်ချက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ ဤသည်မှာ ခွဲခြမ်းစိတ်ဖြာ (ANALYZE) အမိန့်သည် အင်ဒက်စ်တစ်ခုစီတွင်စစ်ဆေးသည့်ခန့်မှန်းခြေမြောက်အရေအတွက်ဖြစ်သည်
pragma-application-id-tips=ဒေတာဘေ့စ်ခေါင်းစီးတွင် offset 68 ရှိ 32-bit အနှုတ်ကိန်း big-endian "Application ID" ကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်အသုံးပြုသည်
pragma-auto-vacuum-tips=ဒေတာဘေ့စ်အတွင်းအလိုအလျောက်ရှင်းလင်းမှုအခြေအနေကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-automatic-index-tips=အလိုအလျောက်အင်ဒက်စ်အကျင့်ကိုစီစစ်ရန်၊ သတ်မှတ်ရန် သို့မဟုတ် ဖြုတ်ရန်ဖြစ်သည်
pragma-busy-timeout-tips=အလုပ်မပြုနေချိန်ကန့်သတ်ချက် (busy timeout) ပြင်ဆင်ချက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-cache-size-tips=ဖွင့်ထားသောဒေတာဘေ့စ်ဖိုင်တစ်ခုစီအတွက် မှတ်ဉာဏ်ထဲတွင် SQLite အကြံပြုထားသောအကြီးဆုံးဒေတာဘေ့စ်ဒစ်စာမျက်နှာအရေအတွက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-cache-spill-tips=အရောင်းအ၀ယ်အလယ်တွင် စစ်ထုတ်ကိရိယာသည် ညစ်ပတ်ထားသော cache စာမျက်နှာများကို ဒေတာဘေ့စ်ဖိုင်သို့ဖြန့်ကျက်ခြင်းကိုဖွင့်ပါ သို့မဟုတ် ပိတ်ပါ
pragma-case-sensitive-like-tips=LIKE အော်ပရေတာ၏ပုံမှန်အပြုအမူသည် ASCII အက္ခရာများ၏အကြီးအကျယ်ကိုလျစ်လျူရှုခြင်းဖြစ်သည်၊ ထို့ကြောင့်ပုံမှန်အားဖြင့် 'a' LIKE 'A' သည်မှန်ကန်သည်
pragma-cell-size-check-tips=ဒေတာဘေ့စ် B tree စာမျက်နှာများကိုဒစ်မှပထမဦးဆုံးဖတ်သောအခါ ထပ်လောင်းကောင်းကျိုးစစ်ဆေးမှုများကိုဖွင့်ပါ သို့မဟုတ် ပိတ်ပါ၊ ဆယ်လ်အရွယ်အစားစစ်ဆေးမှုဖွင့်ထားပါက ဒေတာဘေ့စ်ပျက်စီးမှုကို အစောပိုင်းတွင်ထိရောက်စွာရှာဖွေတွေ့ရှိနိုင်ပြီး "ပြန့်ပွားခြင်း (Spread)" ဖြစ်နိုင်ခြေနည်းပါသည်
pragma-checkpoint-fullfsync-tips=checkpoint လုပ်ဆောင်မှု၏ fullfsync အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ ဤအမှတ်အသားသတ်မှတ်ထားပါက F_FULLFSYNC ကိုပံ့ပိုးသောစနစ်များပေါ်တွင် checkpoint လုပ်ဆောင်မှုအတွင်း F_FULLFSYNC တိုက်ကိုအသုံးပြုမည်ဖြစ်သည်၊ CHECKPOINT_FULLFSYNC အမှတ်အသား၏ပုံမှန်တန်ဖိုးမှာ OFF ဖြစ်သည်၊ Mac OS-X သာ F_FULLFSYNC ကိုပံ့ပိုးပေးသည်
pragma-collation-list-tips=လက်ရှိဒေတာဘေ့စ်ချိတ်ဆက်မှုအတွက်သတ်မှတ်ထားသော စုစည်းမှုအစီအစဥ်စာရင်းကိုပြန်ပေးသည်
pragma-compile-options-tips=SQLite ကိုတည်ဆောက်သည့်အခါအသုံးပြုသော compile-time option များ၏အမည်ကိုပြန်ပေးသည်၊ option တစ်ခုစီအတွက်တစ်လိုင်းစီဖြစ်သည်
pragma-count-changes-tips=အပြောင်းအလဲအရေအတွက်အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ ပုံမှန်အားဖြင့် count-changes အမှတ်အသားမသတ်မှတ်ထားပါက INSERT၊ UPDATE နှင့် DELETE ကြော်ငြာစာများသည်ဒေတာမပြန်ပေးပါ
pragma-data-store-directory-tips=sqlite3_data_directory ကမ္ဘာလုံးဆိုင်ရာကိန်းဂဏန်းတန်ဖိုးကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ Windows operating system interface backend သည် နှိုင်းယှဉ်လမ်းကြောင်းအမည်ဖြင့်သတ်မှတ်ထားသောဒေတာဘေ့စ်ဖိုင်များကိုသိုလှောင်ရန် နေရာကိုဆုံးဖြတ်ရန်အသုံးပြုသည်
pragma-data-version-tips=ဒေတာဘေ့စ်ဖိုင်ကိုပြင်ဆင်ကြောင်းညွှန်ပြသည်၊ မှတ်ဉာဏ်ထဲတွင်ဒေတာဘေ့စ်အကြောင်းအရာများကိုသိမ်းဆည်းထားသော သို့မဟုတ် ဖန်သားပြင်ပေါ်တွင်ဒေတာဘေ့စ်အကြောင်းအရာများပြသသည့်အပြန်အလှန်အကျိုးပြုပရိုဂရမ်များသည် PRAGMA data_version အမိန့်ကိုအသုံးပြုပြီး မှတ်ဉာဏ်ကိုပြန်လည်ဆန်းစစ်ပြီး ပြန်လည်ဖွင့်ရန် သို့မဟုတ် ဖန်သားပြင်ပြသမှုကိုအပ်ဒိတ်လုပ်ရန်လိုအပ်မရှိကြောင်းဆုံးဖြတ်နိုင်သည်
pragma-default-cache-size-tips=ဖွင့်ထားသောဒေတာဘေ့စ်ဖိုင်တစ်ခုစီအတွက် အကြံပြုထားသောအကြီးဆုံးဒစ် cache စာမျက်နှာအရေအတွက်ကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-defer-foreign-keys-tips=ပြင်ပသော့ကန့်သတ်ချက်များအားလုံးကို အပြင်ဆုံးအရောင်းအ၀ယ်တင်သည်အထိရွှေ့ဆိုင်းပါ
pragma-empty-result-callbacks-tips=ရလဒ်မပြုတဲ့ callback အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-encoding-tips=ပင်မဒေတာဘေ့စ်အသုံးပြုသောစာသားကုဒ်ပုံစံ၊ 'UTF-8'၊ 'UTF-16le' (အသေးစား UTF-16 ကုဒ်ပုံစံ) သို့မဟုတ် 'UTF-16be' (အကြီးစား UTF-16 ကုဒ်ပုံစံ) ဖြစ်သည်
pragma-foreign-key-check-tips=ဒေတာဘေ့စ် သို့မဟုတ် ဇယားတွင်ပြင်ပသော့ကန့်သတ်ချက်များချိုးဖောက်နေမရှိကြောင်းစစ်ဆေးပါ
pragma-foreign-keys-tips=ပြင်ပသော့ကန့်သတ်ချက်များ၏ကွပ်ကဲမှုကိုစီစစ်ရန်၊ သတ်မှတ်ရန် သို့မဟုတ် ဖြုတ်ရန်ဖြစ်သည်
pragma-freelist-count-tips=ဒေတာဘေ့စ်ဖိုင်အတွင်းမအသုံးပြုသောစာမျက်နှာအရေအတွက်ကိုပြန်ပေးသည်
pragma-full-column-names-tips=full_column_names အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-fullfsync-tips=fullfsync အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ ဤအမှတ်အသားသည် F_FULLFSYNC တိုက်ကိုပံ့ပိုးသောစနစ်များပေါ်တွင် ထိုနည်းလမ်းကိုအသုံးပြုမရှိကြောင်းဆုံးဖြတ်သည်၊ Fullfsync အမှတ်အသား၏ပုံမှန်တန်ဖိုးမှာ OFF ဖြစ်သည်၊ Mac OS X သာ F_FULLFSYNC ကိုပံ့ပိုးပေးသည်
pragma-hard-heap-limit-tips=လုပ်ငန်းစဉ်တစ်ခုအတွင်း ဒေတာဘေ့စ်ချိတ်ဆက်မှုအားလုံးအတွက် heap memory ပမာဏအပေါ်ကန့်သတ်ချက်တင်သည်
pragma-ignore-check-constraints-tips=စစ်ဆေးကန့်သတ်ချက်များ၏ကွပ်ကဲမှုကိုဖွင့်ပါ သို့မဟုတ် ပိတ်ပါ၊ ပုံမှန်ပြင်ဆင်ချက်မှာ OFF ဖြစ်သည်၊ ဆိုလိုသည်မှာပုံမှန်အားဖြင့် စစ်ဆေးကန့်သတ်ချက်များကိုကွပ်ကဲသည်
pragma-incremental-vacuum-tips=လွတ်လပ်စာရင်းမှ စာမျက်နှာ N ခုအများဆုံးဖယ်ရှားပစ်သည်
pragma-integrity-check-tips=ဒေတာဘေ့စ်အပေါ်အနိမ့်အဆင့်ဖော်မတ်နှင့်တသမတ်တည်းစစ်ဆေးမှုများပြုလုပ်သည်
pragma-journal-mode-tips=လက်ရှိဒေတာဘေ့စ်ချိတ်ဆက်မှုနှင့်ဆက်စပ်သောဒေတာဘေ့စ်၏ဂျာနယ်ပုံစံကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-journal-size-limit-tips=အရောင်းအ၀ယ် သို့မဟုတ် checkpoint ပြီးနောက် ဖိုင်စနစ်အတွင်းထိန်းသိမ်းထားသော rollback journal နှင့် WAL ဖိုင်များ၏အရွယ်အစားကိုကန့်သတ်သည်
pragma-legacy-alter-table-tips=legacy_alter_table အမှတ်အသား၏တန်ဖိုးကိုသတ်မှတ်ရန် သို့မဟုတ် စီစစ်ရန်ဖြစ်သည်
pragma-locking-mode-tips=ဒေတာဘေ့စ်ချိတ်ဆက်မှုပိတ်ချိန်းပုံစံကိုသတ်မှတ်ရန် သို့မဟုတ် စီစစ်ရန်ဖြစ်သည်၊ ပိတ်ချိန်းပုံစံမှာ ပုံမှန်ပုံစံ (NORMAL) သို့မဟုတ် သီးသန့်ပုံစံ (EXCLUSIVE) ဖြစ်သည်
pragma-max-page-count-tips=ဒေတာဘေ့စ်ဖိုင်အတွင်းရှိအကြီးဆုံးစာမျက်နှာအရေအတွက်ကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-mmap-size-tips=ဒေတာဘေ့စ်တစ်ခုအတွက် memory-mapped I/O အတွက်ထားရှိသည့်အကြီးဆုံး byte အရေအတွက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-module-list-tips=ဒေတာဘေ့စ်ချိတ်ဆက်မှုအတွက်မှတ်ပုံတင်ထားသော virtual table module စာရင်းကိုပြန်ပေးသည်
pragma-optimize-tips=ဒေတာဘေ့စ်ကိုပြုပြင်ရန်ကြိုးစားပါ
pragma-page-count-tips=ဒေတာဘေ့စ်ဖိုင်အတွင်းရှိစာမျက်နှာစုစုပေါင်းကိုပြန်ပေးသည်
pragma-page-size-tips=ဒေတာဘေ့စ်၏စာမျက်နှာအရွယ်အစားကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်၊ စာမျက်နှာအရွယ်အစားသည် 512% နှင့် 65536 ကြားရှိ 2 ၏အစွမ်းဖြစ်ရမည်
pragma-parser-trace-tips=SQLite အတွင်းပိုင်းအသုံးပြုသော SQL parser ၏ခြေရာကိုဖွင့်ပါ၊ SQLITE_DEBUG compile-time ဖြင့်အကျိုးပြုသည်
pragma-query-only-tips=ဒေတာဘေ့စ်ဖိုင်ပေါ်တွင်ဒေတာပြောင်းလဲမှုများကိုကာကွယ်ပါ၊ ဤအရာကိုဖွင့်ပါက မည်သည့် CREATE၊ REPORT၊ DROP၊ REPORT သို့မဟုတ် UPDATE ကြိုးပမ်းမှုမဆို SQLITE_READONLY အမှားဖြစ်လိမ့်မည်
pragma-quick-check-tips=ဒေတာဘေ့စ်အပေါ်အနိမ့်အဆင့်ဖော်မတ်နှင့်တသမတ်တည်းစစ်ဆေးမှုများပြုလုပ်သည်၊ UNIQUE နှင့်အင်ဒက်စ်တသမတ်တည်းစစ်ဆေးမှုများကိုကျော်ဖြတ်သည်
pragma-read-uncommitted-tips=မထုတ်ပေးမီဖတ်ရန် အကြားခွဲထားမှုကိုစီစစ်ရန်၊ သတ်မှတ်ရန် သို့မဟုတ် ဖြုတ်ရန်ဖြစ်သည်
pragma-recursive-triggers-tips=အစပျိုးစက်များ၏ပြန်လည်လုပ်ဆောင်မှုကိုစီစစ်ရန်၊ သတ်မှတ်ရန် သို့မဟုတ် ဖြုတ်ရန်ဖြစ်သည်
pragma-reverse-unordered-selects-tips=ဖွင့်ထားပါက ဤ PRAGMA သည် ORDER BY ပုဒ်စုမရှိသော SELECT ကြော်ငြာစာများစွာကို ပုံမှန်နှင့်ဆန့်ကျင်ဘက်အစီအစဥ်ဖြင့်ရလဒ်များထုတ်ပေးသည်
pragma-schema-version-tips=ဒေတာဘေ့စ်ခေါင်းစီးတွင် offset 40 ရှိ schema-version ကိန်းပြည့်တန်ဖိုးကိုရယူရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-secure-delete-tips=လုံခြုံစွာဖျက်ခြင်း (secure-delete) ပြင်ဆင်ချက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-short-column-names-tips=တိုတောင်းသောကွက်လပ်အမည်အမှတ်အသားကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-soft-heap-limit-tips=လုပ်ငန်းစဉ်တစ်ခုအတွင်း ဒေတာဘေ့စ်ချိတ်ဆက်မှုအားလုံးအတွက် သုံးစွဲသည့် heap memory ပမာဏအပေါ်ကန့်သတ်ချက်တင်သည်
pragma-stats-tips=ဇယားနှင့်အင်ဒက်စ်များ၏အကူအညီအချက်အလက်များကိုပြန်ပေးသည်
pragma-synchronous-tips=“synchronous” အမှတ်အသား၏ပြင်ဆင်ချက်ကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်
pragma-temp-store-tips=sqlite3_temp_directory ကမ္ဘာလုံးဆိုင်ရာကိန်းဂဏန်းတန်ဖိုးကိုစီစစ်ရန် သို့မဟုတ် ပြောင်းလဲရန်ဖြစ်သည်၊ operating system interface backend အများစုသည် ယာယီဇယားနှင့်အင်ဒက်စ်များကိုမည်သည့်နေရာတွင်သိုလှောင်ရမည်ကိုဆုံးဖြတ်ရန်အသုံးပြုသည်
pragma-threads-tips=ကြိုတင်ပြင်ဆင်ထားသောကြော်ငြာစာကွက် (prepared statement) အစပျိုးသည့်အကူအညီစီစစ်မှု၏အရန်ကြိုးအရေအတွက်ဖြစ်သည်
pragma-trusted-schema-tips=လုံခြုံစွာစစ်ဆေးမှုမပြုလုပ်ထားသော SQL လုပ်ဆောင်ချက်များနှင့် virtual table များကို schema တွင် run လုပ်ခွင့်ပြုမရှိကြောင်း၊ view၊ အစပျိုးစက် သို့မဟုတ် schema ဖော်ပြချက်များ (CHECK ကန့်သတ်ချက်၊ DEFAULT ပုဒ်စု၊ ထုတ်လုပ်ထားသောကွက်လပ်များ၊ ဖော်ပြချက်အင်ဒက်စ်နှင့်/သို့မဟုတ် တစ်စိတ်တစ်ပိုင်းအင်ဒက်စ်စသည်) လုံခြုံစွာစစ်ဆေးမှုမပြုလုပ်ထားသော SQL လုပ်ဆောင်ချက်များနှင့် virtual table များကို run လုပ်ခွင့်ပြုမရှိကြောင်းဆုံးဖြတ်သည်
pragma-user-version-tips=ဒေတာဘေ့စ်ခေါင်းစီးတွင် offset 60 ရှိ user-version ကိန်းပြည့်တန်ဖိုးကိုရယူရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-vdbe-addoptrace-tips=ပြီးပြည့်စုံသော VDBE လုပ်ဆောင်ချက်ကုဒ်ကို ကုဒ်ထုတ်လုပ်စဉ်အတွင်းဖန်တီးသည့်အခါပြသသည်၊ ရှေ့ပြေးအားဖြင့် SQLite သည် SQLITE_DEBUG option ဖြင့်ကုဒ်ပြင်ဆင်ထားပြီး vdbe_debug ဖွင့်ထားရမည်
pragma-vdbe-debug-tips=VDBE debug ဖွင့်ပါ၊ ရှေ့ပြေးအားဖြင့် SQLite သည် SQLITE_DEBUG option ဖြင့်ကုဒ်ပြင်ဆင်ထားရမည်
pragma-vdbe-listing-tips=ပြီးပြည့်စုံသော virtual machine လုပ်ဆောင်ချက်ကုဒ်စာရင်းကို standard output ပေါ်တွင်ပြသပါ၊ ရှေ့ပြေးအားဖြင့် SQLite သည် SQLITE_DEBUG option ဖြင့်ကုဒ်ပြင်ဆင်ထားပြီး vdbe_debug ဖွင့်ထားရမည်
pragma-vdbe-trace-tips=တွက်ချက်သည့်အခါ virtual machine လုပ်ဆောင်ချက်ကုဒ်ကို standard output ပေါ်တွင်ပုံနှိပ်ပါ၊ ရှေ့ပြေးအားဖြင့် SQLite သည် SQLITE_DEBUG option ဖြင့်ကုဒ်ပြင်ဆင်ထားပြီး vdbe_debug ဖွင့်ထားရမည်
pragma-wal-autocheckpoint-tips=ရေးသားမှုကြိုတင်ဂျာနယ် (write-ahead log)/auto-checkpoint ကြားကာလကိုစီစစ်ရန် သို့မဟုတ် သတ်မှတ်ရန်ဖြစ်သည်
pragma-wal-checkpoint-tips=ဒေတာဘေ့စ်ချိတ်ဆက်မှု D ပေါ်ရှိဒေတာဘေ့စ် X ၏ရေးသားမှုကြိုတင်ဂျာနယ် (write-ahead log) အတွင်းရှိအကြောင်းအရာများကို ဒေတာဘေ့စ်ဖိုင်သို့လွှင့်ပို့ပြီး ရေးသားမှုကြိုတင်ဂျာနယ် (write-ahead log) ကိုပြန်လည်သတ်မှတ်စေသည်
pragma-writable-schema-tips=သာမန် UPDATE၊ INSERT နှင့် DELETE ကြော်ငြာစာများကိုအသုံးပြုပြီး sqlite_schema ဇယားကိုပြောင်းလဲနိုင်သည်၊ သတိပြုပါ- ဤကုဒ်ပြင်ဆင်ချက်ကိုအလွဲသုံးစားပြုခြင်းသည် ဒေတာဘေ့စ်ဖိုင်ပျက်စီးခြင်းကိုအလွယ်တကူဖြစ်စေနိုင်သည်
pragma-save-confirm=PRAGMA ကြော်ငြာစာကွက်သည်ဒေတာဘေ့စ်လည်ပတ်မှုအပေါ်အကျိုးသက်ရောက်မည်ဖြစ်သည်၊ အောက်ပါကြော်ငြာစာကွက်ကိုလုပ်ဆောင်မလား
confirm-exec-text=အတည်ပြု&လုပ်ဆောင်